---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralFloorAnalyzesAs
source: html/5fb0953e-39d7-f3cc-7e23-2d44c58895d4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralFloorAnalyzesAs Property

"Analyze As"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralFloorAnalyzesAs { get; }
```